In [13]:
# apply() -Calculate project salary next year

from datasets import load_dataset
import pandas as pd
import matplotlib.pyplot as plt

# Load Dataset
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [14]:
# df['salary_year_avg'].dropna()
df[pd.notna(df['salary_year_avg'])]['salary_year_avg']

28        109500.0
77        140000.0
92        120000.0
100       228222.0
109        89000.0
            ...
785624    139216.0
785641    150000.0
785648    221875.0
785682    157500.0
785692    157500.0
Name: salary_year_avg, Length: 22003, dtype: float64

In [15]:
df_salary = df[pd.notna(df['salary_year_avg'])].copy()
# df_salary

def projected_salary(salary):
    return salary * 1.03  

# apply() mehtod
# df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(projected_salary) 

# apply() method with annonomous function (using lambda)
df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(lambda salary: 1.03 * salary)

df_salary[['salary_year_avg', 'salary_year_inflated']]

        salary_year_avg  salary_year_inflated
28             109500.0             112785.00
77             140000.0             144200.00
92             120000.0             123600.00
100            228222.0             235068.66
109             89000.0              91670.00
...                 ...                   ...
785624         139216.0             143392.48
785641         150000.0             154500.00
785648         221875.0             228531.25
785682         157500.0             162225.00
785692         157500.0             162225.00

[22003 rows x 2 columns]

In [16]:
# converting job_skills coulumn to list
# type(df['job_skills'][1]) #it is a str type

import ast
# ast.literal_eval(df['job_skills'][1]) #ast is a module in python and .literal_eval() is a method used to convert str to list

# def clean_list(skill_list):
#     if pd.notna(skill_list):
#         return ast.literal_eval(skill_list)

# df['job_skills'] = df['job_skills'].apply(clean_list)

In [17]:
df['job_skills'][1]

"['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']"

In [ ]:
# converting job_skills coulumn to list using lambda function
df['job_skills'] = df['job_skills'].apply(lambda skill_list: ast.literal_eval(skill_list) if pd.notna(skill_list) else skill_list)

In [21]:
df['job_skills'][10]

['python', 'databricks', 'azure', 'spark']

In [23]:
def projected_salary(row):
    if 'Senior' in row['job_title_short']:
        return 1.05 * row['salary_year_avg']
    else:
        return 1.03 * row['salary_year_avg']
    
df_salary['salary_year_inflated'] = df.apply(projected_salary, axis=1)

df_salary[['job_title_short', 'salary_year_avg', 'salary_year_inflated']]

       job_title_short  salary_year_avg  salary_year_inflated
28      Data Scientist         109500.0             112785.00
77       Data Engineer         140000.0             144200.00
92       Data Engineer         120000.0             123600.00
100     Data Scientist         228222.0             235068.66
109       Data Analyst          89000.0              91670.00
...                ...              ...                   ...
785624   Data Engineer         139216.0             143392.48
785641   Data Engineer         150000.0             154500.00
785648  Data Scientist         221875.0             228531.25
785682  Data Scientist         157500.0             162225.00
785692  Data Scientist         157500.0             162225.00

[22003 rows x 3 columns]